uat_chat/InformationRegisters/ксРегистрацияОбменаБлокировкиВПерфБазе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ксРегистрацияОбменаБлокировкиВПерфБазе</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ксУдаленныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/ксРегистрацияОбменаБлокировкиВПерфБазе/Ext/ManagerModule.bsl
Процедура ЗаписатьРегистрацию(Обк)  Экспорт
	ТекСС = Обк.ссылка;
	Если ЗначениеЗаполнено(ТекСС) = ложь ТОгда Возврат; КонецЕСЛИ;
	
	Наб = РегистрыСведений.ксРегистрацияОбменаБлокировкиВПерфБазе.СоздатьНаборЗаписей();
	Наб.Отбор.Док.Установить(ТекСС);
	Зап = Наб.Добавить();
	Зап.Док = Тексс;
	Зап.ДатаБлокировки = ТекСС.ДатаЗаписиБлокировки;
	
	Наб.Записать();
	
КонецПроцедуры

Функция ПолучитьЗаписьРегистрации(ТекСС) Экспорт
	
	Стк = Новый Структура("ДтРег,ДтИзм",Неопределено,Неопределено);
	Если ЗначениеЗаполнено(ТекСС) = ложь ТОгда Возврат Стк; КонецЕСЛИ;
	
	Наб = РегистрыСведений.ксРегистрацияОбменаБлокировкиВПерфБазе.СоздатьНаборЗаписей();
	Наб.Отбор.Док.Установить(ТекСС);
	Наб.Прочитать();
	Если Наб.Количество() = 0 Тогда Возврат Стк; КонецесЛИ;
	Стк.ДтРег = Наб[0].ДатаРегистрации;
	Стк.ДтИзм = Наб[0].ДатаБлокировки;
	
	Возврат Стк;
	
КонецФункции
